results/1/server1/apiary-1.3.0/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.01ms   14.68ms   1.07s    99.61%
    Req/Sec    16.97k     3.37k   30.50k    72.09%
  988431 requests in 30.00s, 138.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 592
Requests/sec:  32946.80
Transfer/sec:      4.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.96ms   16.46ms   1.37s    99.64%
    Req/Sec    17.02k     2.69k   31.74k    66.97%
  990849 requests in 30.00s, 138.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 157
Requests/sec:  33028.00
Transfer/sec:      4.63MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.23ms   18.94ms   1.76s    99.76%
    Req/Sec    16.84k     2.51k   28.62k    67.39%
  985138 requests in 30.00s, 138.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 92
Requests/sec:  32837.56
Transfer/sec:      4.60MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.09ms   16.91ms   1.53s    99.69%
    Req/Sec    16.64k     2.47k   29.40k    66.39%
  970323 requests in 30.00s, 136.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 309
Requests/sec:  32344.09
Transfer/sec:      4.53MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.10ms   14.10ms   1.58s    97.75%
    Req/Sec    17.04k     3.38k   31.82k    65.49%
  988132 requests in 30.00s, 138.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 553
Requests/sec:  32937.39
Transfer/sec:      4.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.96ms  188.26ms   1.93s    98.64%
    Req/Sec    16.65k     6.11k   41.45k    62.27%
  951672 requests in 30.00s, 133.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 243
Requests/sec:  31721.77
Transfer/sec:      4.45MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.42ms   19.00ms   1.81s    99.71%
    Req/Sec    15.98k     2.24k   25.77k    69.44%
  939422 requests in 30.00s, 131.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 76
Requests/sec:  31313.91
Transfer/sec:      4.39MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.49ms  152.39ms   2.25s    99.41%
    Req/Sec    16.43k     4.50k   38.27k    68.50%
  938041 requests in 30.00s, 131.50MB read
  Socket errors: connect 0, read 0, write 0, timeout 468
Requests/sec:  31266.32
Transfer/sec:      4.38MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    84.52ms  296.52ms   1.92s    95.30%
    Req/Sec    17.40k     5.72k   42.78k    69.69%
  986621 requests in 30.00s, 138.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 270
Requests/sec:  32886.92
Transfer/sec:      4.61MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.85ms   19.19ms   1.81s    99.69%
    Req/Sec    16.05k     2.42k   25.96k    70.28%
  939944 requests in 30.00s, 131.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 347
Requests/sec:  31331.26
Transfer/sec:      4.39MB
=================== summary ===================
machine:      server1
ghc version:  7.8.4
bench target: apiary-1.3.0
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      32261.40
stdev:        766.58
=================== oneline ===================
server1,7.8.4,apiary-1.3.0,AFTER_DEEP,30s,10,32261.40,766.58